
### Helmfile Diff


```diff


Acquiring state lock. This may take a few moments...
azurerm_resource_group.dev-rg: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_virtual_network.vnet-dev will be created
  + resource "azurerm_virtual_network" "vnet-dev" {
      + address_space       = [
          + "192.168.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "centralindia"
      + name                = "vnet-dev"
      + resource_group_name = "dev-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "CreatedByTerraform" = "true"
          + "Environment"        = "dev"
          + "OwningProjects"     = "All"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...


```
